/*************************************************************************
    > File Name: Algorithm.c
    > Author: lwei
    > Mail: root@163.com 
    > Created Time: 2018年03月24日 星期六 23时16分10秒
 ************************************************************************/

#include<stdio.h>

int main(void)
{
	int i,j,k;
	for(i = 1; i < 20; i++)
	{
		for(j = 1; j < 33; j++)
		{
			k = 100 - i - j;
			if(k % 3 == 0 && (i * 5 + j * 3 + z / 3 ==  100))
			{
				printf("公鸡:%d,母鸡:%d,小鸡:%d", i, j, k);
			}
		}
	}
	return 0;
}
